#obfuscated powershell detection.
Synopsis: I simulated obfuscated PowerShell execution using Base64-encoded commands and successfully detected the activity using Sysmon Event ID 1 and Splunk. This exercise demonstrates how attackers hide malicious payloads inside encoded or obfuscated PowerShell to evade security controls.

Investigative Analysis: At 13:36:22 UTC, Sysmon Event ID 1 recorded the following process creation: 
powershell.exe -nop -w hidden -enc SQBFAFgA. 

This command exhibited multiple signs of suspicious PowerShell behavior such as:
-nop, disabling PowerShell profiles
-w hidden, hiding the window
-enc, which loads Base64-encoded content. 
Executed from a typical Powershell parent process, but with parameters strongly associated with malicious execution. 

Splunk Query Used: index=* EventCode=1 process_name="powershell.exe"
| search CommandLine="*-enc*"
| table _time process_name CommandLine ParentImage

Relevant Logs: CommandLine, ParentImage, _time, process_name

Event IDs: 1 - Process Creation

MITRE ATT&CK Stages: 
T1059.001 - PowerShell to execute potential malicious payloads
T1027 - Binary Padding (Obfuscated Files or Information)

Risk Level: High
Why?: Obfuscated PowerShell typically indicates purposeful evasion. In real environments legitimate admins rarely obfuscate commands so, experiencing this in real production environment indicates irregular system activity that should be investigated. 

Recommended Mitigations: Principle of Least Privilege, Active Threat Hunting, Block Powershell Downgrade/Bypass

Lessons Learned: This exercise improved my understanding of how PowerShell can be abused in real-world intrusions and reinforced the importance of command-line monitoring and parent-child process analysis. While no malicious activity was detected in this controlled environment, I hope I got to showcase my ability to discover irregular Powershell commands.  
